## EXERCISE #1: WHO ALCOHOL CONSUMPTION

* WHO alcohol consumption data:
**    article: http://fivethirtyeight.com/datalab/dear-mona-followup-where-do-people-drink-the-most-beer-wine-and-spirits/    
** original data: https://github.com/fivethirtyeight/data/tree/master/alcohol-consumption
** file: drinks.csv (with additional 'continent' column)

#### read drinks.csv into a DataFrame called 'drinks'

In [1]:
import pandas as pd

In [2]:
drinks = pd.read_csv('../data/drinks.csv')

#### print the head and the tail

In [3]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [4]:
drinks.tail()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

#### examine the default index, data types, and shape

In [5]:
drinks.index

RangeIndex(start=0, stop=193, step=1)

In [6]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [7]:
drinks.shape

(193, 6)

#### print the 'beer_servings' Series

In [8]:
drinks['beer_servings']

0        0
1       89
2       25
3      245
4      217
5      102
6      193
7       21
8      261
9      279
10      21
11     122
12      42
13       0
14     143
15     142
16     295
17     263
18      34
19      23
20     167
21      76
22     173
23     245
24      31
25     231
26      25
27      88
28      37
29     144
      ...
163    128
164     90
165    152
166    185
167      5
168      2
169     99
170    106
171      1
172     36
173     36
174    197
175     51
176     51
177     19
178      6
179     45
180    206
181     16
182    219
183     36
184    249
185    115
186     25
187     21
188    333
189    111
190      6
191     32
192     64
Name: beer_servings, Length: 193, dtype: int64

#### calculate the average 'beer_servings' for the entire dataset

In [9]:
drinks['beer_servings'].mean()

106.16062176165804

#### count the number of occurrences of each 'continent' value and see if it looks correct

In [10]:
drinks.continent.isnull().sum()

23

In [11]:
drinks['continent'].value_counts(dropna=False)

AF     53
EU     45
AS     44
NaN    23
OC     16
SA     12
Name: continent, dtype: int64

In [12]:
drinks.continent.values

array(['AS', 'EU', 'AF', 'EU', 'AF', nan, 'SA', 'EU', 'OC', 'EU', 'EU',
       nan, 'AS', 'AS', nan, 'EU', 'EU', nan, 'AF', 'AS', 'SA', 'EU',
       'AF', 'SA', 'AS', 'EU', 'AF', 'AF', 'AF', 'AF', 'AS', 'AF', nan,
       'AF', 'AF', 'SA', 'AS', 'SA', 'AF', 'AF', 'OC', nan, 'EU', nan,
       'EU', 'EU', 'AS', 'AF', 'EU', 'AF', nan, nan, 'SA', 'AF', nan,
       'AF', 'AF', 'EU', 'AF', 'OC', 'EU', 'EU', 'AF', 'AF', 'EU', 'EU',
       'AF', 'EU', nan, nan, 'AF', 'AF', 'SA', nan, nan, 'EU', 'EU', 'AS',
       'AS', 'AS', 'AS', 'EU', 'AS', 'EU', nan, 'AS', 'AS', 'AS', 'AF',
       'OC', 'AS', 'AS', 'AS', 'EU', 'AS', 'AF', 'AF', 'AF', 'EU', 'EU',
       'AF', 'AF', 'AS', 'AS', 'AF', 'EU', 'OC', 'AF', 'AF', nan, 'OC',
       'EU', 'AS', 'EU', 'AF', 'AF', 'AS', 'AF', 'OC', 'AS', 'EU', 'OC',
       nan, 'AF', 'AF', 'OC', 'EU', 'AS', 'AS', 'OC', nan, 'OC', 'SA',
       'SA', 'AS', 'EU', 'EU', 'AS', 'AS', 'EU', 'EU', 'AS', 'AF', nan,
       nan, nan, 'OC', 'EU', 'AF', 'AS', 'AF', 'EU', 'AF', 'AF', 'AS',
       'EU', 'EU', 'OC', 'AF', 'AF', 'EU', 'AS', 'AF', 'SA', 'AF', 'EU',
       'EU', 'AS', 'AS', 'AS', 'EU', 'AS', 'AF', 'OC', nan, 'AF', 'AS',
       'AS', 'OC', 'AF', 'EU', 'AS', 'EU', 'AF', nan, 'SA', 'AS', 'OC',
       'SA', 'AS', 'AS', 'AF', 'AF'], dtype=object)

In [13]:
drinks.continent.fillna(value='NOTHING', inplace=True)
# to examine the NaN values, I changed the nan to 'NOTHING'.

In [14]:
drinks[drinks['continent'] == 'NOTHING'].values
#when I look the nan values in the continent column, North America countries such as USA or Canada, assigned as 'nan' and python consider 'nan' as non value mistakenly.It actually shows North America countries.

array([['Antigua & Barbuda', 102, 128, 45, 4.9, 'NOTHING'],
       ['Bahamas', 122, 176, 51, 6.3, 'NOTHING'],
       ['Barbados', 143, 173, 36, 6.3, 'NOTHING'],
       ['Belize', 263, 114, 8, 6.8, 'NOTHING'],
       ['Canada', 240, 122, 100, 8.2, 'NOTHING'],
       ['Costa Rica', 149, 87, 11, 4.4, 'NOTHING'],
       ['Cuba', 93, 137, 5, 4.2, 'NOTHING'],
       ['Dominica', 52, 286, 26, 6.6, 'NOTHING'],
       ['Dominican Republic', 193, 147, 9, 6.2, 'NOTHING'],
       ['El Salvador', 52, 69, 2, 2.2, 'NOTHING'],
       ['Grenada', 199, 438, 28, 11.9, 'NOTHING'],
       ['Guatemala', 53, 69, 2, 2.2, 'NOTHING'],
       ['Haiti', 1, 326, 1, 5.9, 'NOTHING'],
       ['Honduras', 69, 98, 2, 3.0, 'NOTHING'],
       ['Jamaica', 82, 97, 9, 3.4, 'NOTHING'],
       ['Mexico', 238, 68, 5, 5.5, 'NOTHING'],
       ['Nicaragua', 78, 118, 1, 3.5, 'NOTHING'],
       ['Panama', 285, 104, 18, 7.2, 'NOTHING'],
       ['St. Kitts & Nevis', 194, 205, 32, 7.7, 'NOTHING'],
       ['St. Lucia', 171, 315, 71, 10.1, 'NOTHING'],
       ['St. Vincent & the Grenadines', 120, 221, 11, 6.3, 'NOTHING'],
       ['Trinidad & Tobago', 197, 156, 7, 6.4, 'NOTHING'],
       ['USA', 249, 158, 84, 8.7, 'NOTHING']], dtype=object)

## EXERCISE #2

#### filter DataFrame to only include European countries

In [15]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [16]:
drinks[drinks.continent == 'EU']

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
1,Albania,89,132,54,4.9,EU
3,Andorra,245,138,312,12.4,EU
7,Armenia,21,179,11,3.8,EU
9,Austria,279,75,191,9.7,EU
10,Azerbaijan,21,46,5,1.3,EU
15,Belarus,142,373,42,14.4,EU
16,Belgium,295,84,212,10.5,EU
21,Bosnia-Herzegovina,76,173,8,4.6,EU
25,Bulgaria,231,252,94,10.3,EU
42,Croatia,230,87,254,10.2,EU
44,Cyprus,192,154,113,8.2,EU
45,Czech Republic,361,170,134,11.8,EU
48,Denmark,224,81,278,10.4,EU
57,Estonia,224,194,59,9.5,EU
60,Finland,263,133,97,10.0,EU
61,France,127,151,370,11.8,EU
64,Georgia,52,100,149,5.4,EU
65,Germany,346,117,175,11.3,EU
67,Greece,133,112,218,8.3,EU
75,Hungary,234,215,185,11.3,EU
76,Iceland,233,61,78,6.6,EU
81,Ireland,313,118,165,11.4,EU
83,Italy,85,42,237,6.5,EU
93,Latvia,281,216,62,10.5,EU
98,Lithuania,343,244,56,12.9,EU
99,Luxembourg,236,133,271,11.4,EU
105,Malta,149,100,120,6.6,EU
111,Monaco,0,0,0,0.0,EU
113,Montenegro,31,114,128,4.9,EU
120,Netherlands,251,88,190,9.4,EU
126,Norway,169,71,129,6.7,EU
135,Poland,343,215,56,10.9,EU
136,Portugal,194,67,339,11.0,EU
139,Moldova,109,226,18,6.3,EU
140,Romania,297,122,167,10.4,EU
147,San Marino,0,0,0,0.0,EU
151,Serbia,283,131,127,9.6,EU
155,Slovakia,196,293,116,11.4,EU
156,Slovenia,270,51,276,10.6,EU
160,Spain,284,157,112,10.0,EU
165,Sweden,152,60,186,7.2,EU
166,Switzerland,185,100,280,10.2,EU
170,Macedonia,106,27,86,3.9,EU
180,Ukraine,206,237,45,8.9,EU
182,United Kingdom,219,126,195,10.4,EU

#### filter DataFrame to only include European countries with wine_servings > 300

In [17]:
drinks[(drinks.continent == 'EU') & (drinks.wine_servings > 300)]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
3,Andorra,245,138,312,12.4,EU
61,France,127,151,370,11.8,EU
136,Portugal,194,67,339,11.0,EU

#### calculate the average 'beer_servings' for all of Europe

In [18]:
drinks[drinks.continent == 'EU'].beer_servings.mean()

193.77777777777777

#### determine which 10 countries have the highest 'total_litres_of_pure_alcohol'

In [19]:
drinks.sort_values('total_litres_of_pure_alcohol', ascending=False).head(10)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
15,Belarus,142,373,42,14.4,EU
98,Lithuania,343,244,56,12.9,EU
3,Andorra,245,138,312,12.4,EU
68,Grenada,199,438,28,11.9,NOTHING
45,Czech Republic,361,170,134,11.8,EU
61,France,127,151,370,11.8,EU
141,Russian Federation,247,326,73,11.5,AS
81,Ireland,313,118,165,11.4,EU
155,Slovakia,196,293,116,11.4,EU
99,Luxembourg,236,133,271,11.4,EU

## EXERCISE 3: USE UFO DATASET

* National UFO Reporting Center data:
** main page: http://www.nuforc.org/webreports.html
** file: ufo.csv

#### read ufo.csv into a DataFrame called 'ufo'

In [20]:
import pandas as pd

In [21]:
ufo = pd.read_csv('../data/ufo.csv')

#### check the shape of the DataFrame

In [22]:
ufo.shape

(80543, 5)

#### what are the three most common colors reported?

In [23]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [24]:
ufo['Colors Reported'].value_counts()

ORANGE                          5216
RED                             4809
GREEN                           1897
BLUE                            1855
YELLOW                           842
RED ORANGE                       486
RED GREEN                        469
RED BLUE                         445
RED GREEN BLUE                   166
GREEN BLUE                       147
RED YELLOW                       146
ORANGE YELLOW                    137
ORANGE GREEN                      66
ORANGE BLUE                       58
YELLOW GREEN                      53
RED YELLOW BLUE                   36
RED YELLOW GREEN                  35
RED ORANGE YELLOW                 32
YELLOW BLUE                       27
RED YELLOW GREEN BLUE             26
RED ORANGE BLUE                   21
YELLOW GREEN BLUE                 13
ORANGE GREEN BLUE                 13
RED ORANGE GREEN                  12
RED ORANGE GREEN BLUE              8
ORANGE YELLOW GREEN                5
RED ORANGE YELLOW GREEN            4
ORANGE YELLOW BLUE                 3
ORANGE YELLOW GREEN BLUE           3
RED ORANGE YELLOW BLUE             2
RED ORANGE YELLOW GREEN BLUE       2
Name: Colors Reported, dtype: int64

#### Rename any columns with spaces so that they don't contain space. Make it inplace.

In [25]:
ufo = ufo.rename(columns={'Shape Reported':'Shape_Reported'})

In [26]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')

#### for reports in VA, what's the most common city?

In [27]:
ufo.head()

                   City Colors Reported Shape_Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [28]:
ufo[ufo['State'] == 'VA'].City.value_counts()

Virginia Beach           110
Richmond                  92
Alexandria                48
Roanoke                   35
Chesapeake                33
Norfolk                   31
Fredericksburg            31
Arlington                 30
Woodbridge                27
Hampton                   26
Manassas                  23
Fairfax                   22
Charlottesville           22
Newport News              22
Lynchburg                 21
Winchester                19
Williamsburg              18
Portsmouth                17
Stafford                  17
Danville                  17
Vienna                    16
Midlothian                15
Leesburg                  15
Harrisonburg              14
Falls Church              14
Front Royal               13
Sterling                  13
Ashburn                   12
Gainesville               12
Springfield               12
                        ...
Markham                    1
I-95                       1
St. Paul                   1
Tappahannock               1
Patrick County             1
Meadowview                 1
Charles City Co.           1
no data                    1
Emporia                    1
North Chesterfield         1
Bottoms Bridge             1
Brownsburg                 1
Gretna                     1
Ashnurn                    1
Elberon                    1
Draper                     1
Lebanon Church             1
Clover                     1
Chesterfeild               1
Walkerton                  1
Verona                     1
Ringgold                   1
Richalnds                  1
Mason Neck                 1
Faber                      1
Penn Laird                 1
Rockville                  1
buckingham                 1
Dulles                     1
Haymarket-Gainesville      1
Name: City, Length: 397, dtype: int64

#### print a DataFrame containing only reports from Arlington, VA

In [29]:
ufo[(ufo.State == 'VA') & (ufo.City =='Arlington')].values

array([['Arlington', 'GREEN', 'OVAL', 'VA', '7/13/1952 21:00'],
       ['Arlington', nan, 'CHEVRON', 'VA', '5/5/1990 21:40'],
       ['Arlington', nan, 'DISK', 'VA', '5/27/1997 15:30'],
       ['Arlington', nan, 'OTHER', 'VA', '9/10/1999 21:41'],
       ['Arlington', 'RED', 'DISK', 'VA', '11/19/2000 22:00'],
       ['Arlington', 'GREEN', 'FIREBALL', 'VA', '1/7/2002 17:45'],
       ['Arlington', nan, 'LIGHT', 'VA', '7/26/2002 1:15'],
       ['Arlington', nan, 'LIGHT', 'VA', '8/7/2002 21:00'],
       ['Arlington', nan, 'CIGAR', 'VA', '6/1/2003 22:34'],
       ['Arlington', nan, 'VARIOUS', 'VA', '12/13/2003 2:00'],
       ['Arlington', nan, 'CIRCLE', 'VA', '10/9/2004 22:30'],
       ['Arlington', nan, 'FORMATION', 'VA', '12/13/2004 0:30'],
       ['Arlington', nan, 'LIGHT', 'VA', '3/15/2006 22:30'],
       ['Arlington', nan, 'TRIANGLE', 'VA', '8/1/2006 22:00'],
       ['Arlington', nan, 'LIGHT', 'VA', '4/7/2007 18:45'],
       ['Arlington', nan, 'FLASH', 'VA', '8/15/2007 1:30'],
       ['Arlington', nan, 'TRIANGLE', 'VA', '6/6/2008 21:55'],
       ['Arlington', nan, 'OVAL', 'VA', '8/2/2008 20:30'],
       ['Arlington', nan, 'SPHERE', 'VA', '4/24/2009 17:45'],
       ['Arlington', nan, 'LIGHT', 'VA', '9/17/2010 19:00'],
       ['Arlington', nan, 'SPHERE', 'VA', '10/12/2010 19:00'],
       ['Arlington', nan, 'FIREBALL', 'VA', '6/25/2013 23:00'],
       ['Arlington', 'RED', 'SPHERE', 'VA', '9/26/2013 21:20'],
       ['Arlington', nan, 'CIRCLE', 'VA', '10/19/2013 0:17'],
       ['Arlington', nan, 'LIGHT', 'VA', '11/1/2013 22:42'],
       ['Arlington', nan, 'CIGAR', 'VA', '2/21/2014 14:30'],
       ['Arlington', nan, nan, 'VA', '3/1/2014 20:00'],
       ['Arlington', nan, 'FORMATION', 'VA', '3/1/2014 23:30'],
       ['Arlington', 'RED ORANGE', 'LIGHT', 'VA', '5/24/2014 22:30'],
       ['Arlington', nan, 'CIRCLE', 'VA', '7/7/2014 21:00']], dtype=object)

#### count the number of missing values in each column

In [30]:
ufo.isnull().sum()

City                  47
Colors Reported    63509
Shape_Reported      8402
State                  0
Time                   0
dtype: int64

#### how many rows remain if you drop all rows with any missing values?

In [31]:
ufo2 = ufo.dropna()
ufo2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15510 entries, 12 to 80541
Data columns (total 5 columns):
City               15510 non-null object
Colors Reported    15510 non-null object
Shape_Reported     15510 non-null object
State              15510 non-null object
Time               15510 non-null object
dtypes: object(5)
memory usage: 727.0+ KB

## EXERCISE 4

In this part, I'll be working with datasets described below:

* MovieLens 100k movie rating data:
** main page: http://grouplens.org/datasets/movielens/
** data dictionary: http://files.grouplens.org/datasets/movielens/ml-100k-README.txt

#### for each occupation in 'users', count the number of occurrences

In [32]:
import pandas as pd

In [33]:
user = pd.read_table('../data/u.user')

In [34]:
user.head() #I need to assign column first

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [35]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('../data/u.user', 
                      sep='|', 
                      header=None, 
                      names=user_cols,
                      index_col='user_id',
                      dtype={'zip_code':str})

In [36]:
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [37]:
users.groupby('occupation').occupation.count()

occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
Name: occupation, dtype: int64

#### for each occupation, calculate the mean age

In [38]:
users.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

#### for each occupation, calculate the minimum and maximum ages

In [39]:
users.groupby('occupation').age.agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

#### for each combination of occupation and gender, calculate the mean age

In [40]:
users.groupby(['occupation', 'gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64